// Hunt for Vulnerable Drivers in the organization
// 
// When a malicious driver is loaded, we have a fundamental log on DeviceEvents called "DriverLoad".
// In this query, we are taking in all such driver hashes from loldrivers, and checking on each DriverLoads for a hash match.
// 
let VulnDrivers = 
externaldata (KnownVulnerableSamples:dynamic) 
    [
    h@"https://www.loldrivers.io/api/drivers.json"
    ]
    with (format=multijson)
| mv-expand KnownVulnerableSamples
| extend FileName = parse_json(KnownVulnerableSamples).Filename
| extend SHA1 = tostring(parse_json(KnownVulnerableSamples).SHA1)
| extend SHA256 = tostring(parse_json(KnownVulnerableSamples).SHA256)
| project FileName, SHA1, SHA256;
//  
DeviceEvents
| where ActionType =~ "DriverLoad"
| join kind=inner ( VulnDrivers ) on SHA1, SHA256
